---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCFile.CreateInstance(System.String)
source: html/26d1cbe9-1814-1b01-72d0-43405a6a7d28.htm
---
# Autodesk.Revit.DB.IFC.IFCFile.CreateInstance Method

Creates an IFC instance in the file model.

## Syntax (C#)
```csharp
public IFCAnyHandle CreateInstance(
	string name
)
```

## Parameters
- **name** (`System.String`) - The instance name.

## Returns
The instance handle.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null